[{"question":"Which year was the 49th NHL Entry Draft where Emil Molin selected by the Dallas Stars in the 4th round?"},{"question":"When did the man overthrown in the Libyan Crisis become the leader of Libya?"},{"question":"Are Cynara and Piptanthus both flowering plants?"},{"question":"what chairman of the Senate Foreign Relations Committee inspired songs on the studio album  Social Studies? "},{"question":"At 2006 Dubai Tennis Championships – Men's Singles, Rafael Nadal defeated the defending champion who has won how many Grand Slam singles titles?"},{"question":" What city was the birthplace of the German physicist for which Hund's coupling cases in the spectroscopy of diatomic molecules are name for?"},{"question":"Which party princesses fictional character is voiced by Eva Bella?"},{"question":"Who is the mother of Princess Carolina of Orange-Nassau and the daughter of King George II of Great Britain?"},{"question":"Ignacio E. Lozano Jr. was appointed to his position by what 38th President"},{"question":"What midfielder is captain of the US men's soccer team and joined Toronto FC for the 2014 season?"},{"question":"Chow Chow and German Wirehaired Pointer are both what?"},{"question":"What is the full name of the Welsh singer who was also a guest on the Logie Awards of 1993?"},{"question":"Which game has more pieces, King of Tokyo or Tsuro?"},{"question":"Are Condorman and The African Lion both comedy films?"},{"question":"Who currently owns the New York fashion house in which Lee Williams was the face of?"},{"question":"When was the former Provisional Irish Republican Army (IRA) Terrorist born with whom Joanna Cynthia Berry publicly met in November 2000 for  Good Friday Agreement?"},{"question":"Which American television comedy writer wrote The Winter of His Content?"},{"question":"Who produced the album that included a re-recording of \"Lithium\"?"},{"question":"Gnaeus Pompeius of Pompeia became a member of the First Triumvirate along with this general and politician who played a key role in the transformation of the Roman Republic into the Roman Empire and was the second wealthiest person next to which person?"},{"question":"first movie exhibited in the Ottoman Empire was translated from French into English as what?"},{"question":"Which party won the 1995 San Francisco mayoral election?"},{"question":"What is name of the company that resulted from the merging of Cheung Kong Limited and a Fortune Global 500 investment holding company based in Hong Kong?"},{"question":"Who has more scope of profession, E. L. Doctorow or Julia Peterkin?"},{"question":"What documentary about the Gilgo Beach Killer debuted on November, 2016 on A&E?"},{"question":"What is the setting for the show in which Joel Tobeck plays the demon Baal?"},{"question":"The song Tim Nichols won a Grammy Award for Best Country Song in 2004 was on which Tim McGraw album?"},{"question":"Time Out's 100 best British films was topped by a film adapted from a short story by which author ?"},{"question":"Besides Mederer GmbH, what German companies compete with Haribo?"},{"question":"Who directed the 2010 film that starred the actor that played the scientist Jake on the CW's \"The 100\"?"},{"question":"Was Rien que les heures or The 11th Hour released first?"},{"question":"Are Truckin' Magazine and Girlfriends both publications that offer relationship advice?"},{"question":"A Simple Noodle Story was inspired by the debut of the American filmmakers who created what 1996 film?"},{"question":"When did Morrissey release a cover version of a song from the singer whose debut album was Horses?"},{"question":"Which documentary was filmed in the United States, A Story of Healing or The End of America?"},{"question":"\"Not Giving Up\" is a song by a girl group formed through what record label?"},{"question":"At It Again contains lyrics co-written by the singer and actor from what city?"},{"question":"Which author is English, Studs Terkel or John Braine?"},{"question":"What type of gesture does Minority languages of Austria and Austrian State Treaty have in common?"},{"question":"Who directs the upcoming monster film that a man known for his role as Richard Hendricks in the HBO series \"Silicon Valley\" star in?"},{"question":" John O'Sullivan is currently the editor of what Australian monthly magazine that reviews literature as well as features essays on ideas such as politics, history, universities and the arts?"},{"question":"The Haverhill Historical Society Historic District is located in what county?"},{"question":"Which American musician and front man for the alternative band Dinosaur Jr. also appears on two songs by the band Inherit?"},{"question":"Where is the sports nutrition business established by Oliver Cookson based ?"},{"question":"In what year was the star of Searching for the Elephant star Jo "},{"question":"What American dancer, actor, singer, director, and choreographer was in the 1943 musical comedy Du Barry Was a Lady?"},{"question":"How large is the memorial that forms the boundary of Constitution Gardens on the west  ?"},{"question":"What type of dramatic work does Tom Bosley and Fiorello! have in common?"},{"question":"An analog board was used in which third model of the Macintosh line?"},{"question":"What is the scientific name of the fungus studied byby Ann Gravatt?"},{"question":"In what city's borough would one find the neighborhood in which the \"electric park\" which inspired many others is  located in?"},{"question":"EXIT : E is the first extended play by a South Korean boy group that was originally what?"},{"question":"Who was the director of the 1988 American comedy-fantasy which stars Jeffrey Duncan Jones?"},{"question":"Who directed the remake of the movie that Richard C. Franklin was nominated for at the 63rd Academy Awards?"},{"question":"What director directed both The Ferryman and Road to Perdition?"},{"question":"Are both Jackson Hole Airport and Coastal Carolina Regional Airport located in North Carolina?"},{"question":"What type of competition was the 1963-64 Yugoslav Cup, also named honoring a Slavic communist statesman?"},{"question":"Dazzling Dunks and Basketball Bloopers was hosted by which American sportscaster?"},{"question":"In what year did the voice actor of \"Doc Hudson\" in the animated film \"Cars\" die?"},{"question":"What guided missile destroyer class was comprised of one ship named after a city in Yorkshire and two ships serving the Argentine Navy?"},{"question":"Fritz Goro died in Chappaqua, a hamlet of what town in Westchester County, New York?"},{"question":"Former Dominican-American Major League Baseball, Ruddy Lugo, attended a high school with notable alumni such as which 24th round pick of the Texas Rangers in the 1992 draft?"},{"question":"Did Clyde Geronimi and Maurice Tourneur live during any of the same years?"},{"question":"What was the name of the tour launched in support of Taylor Swift's album focused on the color of her emotions and beginning on March 13, 2013?"},{"question":"Which readers was the series The Lost Journals of Ven Polypheme published for?"},{"question":"Inter IIT Sports Meet is the annual sports tournament of what autonomous public insititutes of higher education in India?"},{"question":"What American animated series is composed by James L. Venable, garnering an Emmy nomination for Main Title Theme Music?"},{"question":"In what decade did the band with an album called The Crystal Method form?"},{"question":"What are the two branches of Robert D. Braun's career field? "},{"question":"The movie Apollo 13 featured an astronaut that was born in what year?"},{"question":"Are Wells Fargo and Southwest Airlines both air carrier companies?"},{"question":"At which University did the sociologist who popularised the term \"Unintended consequences\" spend most of his career and attain the rank of University Professor?"},{"question":"The sea whose port is The Port of Reggio is sometimes considered as a part of which ocean?"},{"question":"Which movie has a performance by the daughter of Christina Harrison?"},{"question":"Are Joe Dante and Ivan Passer both American film directors?"},{"question":"The Urswick School was named after a close friend of Henry VII and which grandmother of Henry VIII?"},{"question":"What medal did this Eritrean-born American long distance runner who was coached by Bob Larsen win during the 2004 Olympics?"},{"question":"Mermaids of Alcatraz Tour had an appearance by the country music songwriter who released what album in 2009?"},{"question":"Who was the director of the 2009 movie featuring Peter Outerbridge as William Easton?"},{"question":"Who was the drummer of the band formed by a founding member of Nirvana after Kurt Cobain's death?"},{"question":"George Ogilvy, 3rd Lord Banff died in which Scottish parish? "},{"question":"What is the birthyear of the American composer that borrowed from \"Second Connecticut\" on four occasions and combined American popular and church-music traditions with European art music?"},{"question":"Sebastian DeVicente starred in The City of Lost Souls with a Hong Kong actress who was the winner of two pageants in what year?"},{"question":"Who did the 1957 winner of the Nobel Prize in Physics work with on the problem of magnetic flux?"},{"question":"At which University does the father of the lead singer of The Joggers work ?"},{"question":"The heir to the Du Pont family fortune sponsored what wrestling team?"},{"question":"What former NBA star with the Philadelphia 76ers is now the captian and coach of a team in the BIG3?"},{"question":"Who did the box cover art for Keith Martin to make Night Below?"},{"question":"Which American actor born in 1915 starred in How to Steal a Million?"},{"question":"In what year was the star of To Hell and Back born?"},{"question":"2016 included the released of the farming simulation RPG published by which company?"},{"question":"For whom did Baker & Myers compose a song for who also starred in the PBS music program \"Austin County Limits\"?"},{"question":"Who co-invented the first electromagnetic telegraph along with one of the Göttingen Seven?"},{"question":"Main Rahoon Ya Na Rahoon was a song by a finalist on what program?"},{"question":"Are Laurence Olivier and Aleksandr Ivanovsky both directors?"},{"question":"Who wrote the movie in which the song \"Nirvana\" was used?"},{"question":" Shane Lee Dawson was known for making comedy videos that included celebrity impersonations of an American singer dubbed the king of what?"},{"question":"Is Morgan State University or Boise State University further west?"},{"question":"Heart on My Sleeve is a song first released by which Australian singer?"},{"question":"\"War Song\" is a 1971 song by Graham Nash and what former member of Buffalo Springfield?"},{"question":"Just Wright starred an American rapper who was born in Newark, and signed with what record label in 1989?"},{"question":"In what year was the host of the 2016 Kids' Choice Sports Awards born?"},{"question":"Who released their debut album first, The Operation M.D. or Framing Hanley ?"},{"question":"The Olympus E-450 is a DSLR camera made by Olympus Corporation, which is headquartered in which city?"},{"question":"Who starred in the last film by Jed Johnson's lover?"},{"question":"Caesars Palace is located between The Mirage and a resort casino owned by what company?"},{"question":"Jet by Day is a band from what Georgia county?"},{"question":"Amigos para la aventura was Directed by this Argentine singer and Actor who was born on what date?"},{"question":"Which Hollywood figure is older, Angelina Jolie or Michael Anderson? "},{"question":" Sophie Grégoire is married to what Canadian politician?"},{"question":"Gene Hackman won an Academy Award for best actor in a movie directed by who ?"},{"question":"What State has a Disney Resort & Spa that is a beachside hotel, resort and vacation destination offering complimentary children's activities and programs and that Djuan Rivers was a General Manager at?"},{"question":"Where was the subject of Godric born?"},{"question":"Narinder Kumar Gupta is Professor of Mechanics at a public institution that was declared to be Institute of National Importance by Government of India under what?"},{"question":"What American vocalist is famous for co-founding the Bangles and collaborating with Matthew Sweet?"},{"question":"Who established the British musical theatre project that revived a lesser-known work of award-winning lyricist Alan Jay Lerner?"},{"question":"At what university was Georg Nees appointed honorary professor of  the scientific and practical approach to computation and its applications?"},{"question":"The Equal Access to COBRA Act was introduced on March 10, 2011 by the American former congressman who represented what district?"},{"question":"A British television dance contest has featured what Brazilian dancing style?"},{"question":"Which French professional football player was awarded the Ballon d'Or in 1991?"},{"question":"In what year did Christela Jacques compete for Miss Universe?"},{"question":"What was the estimated population, in 2016, of the city for which Simon Scott designed artwork for some of the most visually engaging restaurants, clubs and bars?"},{"question":"The play on which the 1953 film directed by Joseph L. Mankiewicz was based on was believed to have been written in what year?"},{"question":"Which actress in Galveston also played a character named \"Betty Cooper\" in another production?"},{"question":"Do Sydney Freeland and Genndy Tartakovsky work in the same industry?"},{"question":"Which disease outbreak of 2002\/3 caused 774 reported deaths, the majority being in Hong Kong, as reported by Andrew Brown for CNN?"},{"question":"What is the occupation of Robi Reed and Theodore Witcher"},{"question":"which university has the highest number of graduated students University of Texas at Austin or  Minnesota State University, Mankato "},{"question":"Which surname of Mongolian origin do the male actors of Bollywood Sha, Aamir, and Salman share?"},{"question":"When was the President of India born who inaugurated Maharashtra Airport Development Company (MADC) on 1 October 2017?"},{"question":"James Ellison founded an extremist terrorist group that had its compound in the northern part of what state?"},{"question":"The mother of Katherine Eunice Schwarzenegger received what award for her coverage of the 1988 Summer Olympics?"},{"question":"What is the name of this musical, writtedn by Jeanie Linders, debuting in March 2001, starring Jeon Soo-kyung, in its Korean production?"},{"question":"How many American causalities were there in the battle that earned Clinton LaVor Romesha the Medal of Honor?"},{"question":"Kimber Aegis is a series of which single-action pistols?"},{"question":"FreeMIDI was a program made for the operating system developed by what company?"},{"question":"The group known as the Continuity IRA, along with the Real IRA, targeted what successor of the Royal Ulster Constabulary?"},{"question":"What person of british nationality also has a Ghanian passport?"},{"question":"In which city is the college Phillip Henry Bridenbaugh attended located?"},{"question":"What was the middle name of the aviator featured in \"The Smithsonian Institution\"?"},{"question":"\"Sal de Mi Piel\" is a song by a woman originally of what nationality?"},{"question":"Both Nalini by Day, Nancy by Night and Capturing the Friedmans are what type of films?"},{"question":"Which red wine variety made in Nistreana is increasingly celebrated as an Argentine varietal wine?"},{"question":"What country is Kristaps Porziņģis, the the current champion of the New York Knicks, from?"},{"question":"What group did Marketa Irglova's \"Once\" co-star perform in?"},{"question":"What film stars Will Smith as police officer, and Happy Anderson as a human who works for the FBI's magic division?"},{"question":"In what country is the artist who released Ice on Fire born?"},{"question":"Which cast member from the original 1984 movie made a cameo appearance in the 2016 comedy remake?"},{"question":"What Superdome was SuperBowl XLVI played at in New Orleans, LA?"},{"question":"What type of ore was mined at both Thompson-Lundmark Mine and Leckie Mine?"},{"question":"Was Adam Anderson in the the Hurts or The Virgins?"},{"question":"Do the genera Bloomeria and Weigela describe species that live in the same region?"},{"question":"Radiohead and Oceansize are bands that play which type of music?"},{"question":"Who produced the 1985 film starring Bruce M. Fischer?"},{"question":"What was the name of the gang that the authors of \"Our Story\" were involved with?"},{"question":"Where did the older brother of Michael Dean Perry play college football?"},{"question":"What caused members of Alfred Shaker Historic District move to Sabbathday Lake Shaker Village?"},{"question":"Are Frida, en trotjänarinna and Stations of the Elevated both documentaries aired in Denmark?"},{"question":"Jimmy Eriksson will race in the last 2016 GP2 Series before it gets renamed"},{"question":"When was the Austrian band formed that made the album Solo?"},{"question":"The list of players who have played for the Princeton Rays includes what player nicknamed \"The Perfect Storm\"?"},{"question":"What occupation do Aleksandr Lyapunov and Yuri Matiyasevich have in common?"},{"question":"Who controlled the commando that kidnapped Dani Yako and detained him for three days in the Libertador Building?"},{"question":"A global hospitality and entertainment company operates destination resorts including Bellagio, and a luxyry resort on the Las Vegas Strip, that is how many stories?"},{"question":"What is the name of the first collection of poems or the American poet who appeared in numerous literary magazines, including one that added a book division with Elizabeth Ellen as editor?"},{"question":"When was the American stand-up comedian who was a supporting cast in \"Who's the Caboose?\" born? "},{"question":"Which film that Steve Yedlin worked on stars Bruce Willis? "},{"question":"Attack of the 5 Ft. 2 In. Women parodied the attack committed by the former figure skater who won the US Figure Skating Championships in what year?"},{"question":"who sings By the way and Universally speaking?"},{"question":"Which medal did the writer of \"Smile\" earn?"},{"question":"Which documentary series included an episode discussing the album including songs composed by Gedy Lee and Alex Lifeson with lyrics by Neil Peart telling a story set in a dystopian future?"},{"question":"Who currently holds the same title that Ian Gundry-White held in 1961?"},{"question":"What show that Tom Warburton worked on aired from September 3, 2010 to April 4, 2014?"},{"question":"What is the name of the Japanese manga series written by Eiichrio Oda and voice-acted by Travis Willingham?"},{"question":"Do the Canadian band Marianas Trench and the American singer Poe have different music styles?"},{"question":"In between Jason Kartalian and Fernando Arrabal who describes himself as \"desterrado\"?"},{"question":"Which game is mathematical, Acronymble or Rithmomachy?"},{"question":"Are Tony Hadley and Ian Ball of the same nationality?"},{"question":"What was the contribution made by de Graaff to the technology John Trump and Robert Van de Graaff developed together?"},{"question":"A Brilliant Genocide was written about a revolution started by which resistance leader?"},{"question":"What genre of music has American musicians Jonathan Davis and Philip Labonte both have in common in the bands they have played in?"},{"question":"Which team defeated the 49ers by 34-31 in the 2013 Super Bowl?"},{"question":"Which musician is older, M. Shadows or Justine Frischmann?"},{"question":"When did the criminal gang formed by someone serving six life sentences at the ADX Florence supermax prison in Colorado?"},{"question":"What Amherst, Masschusetts band was John Agnello involved with?"},{"question":"What type of authors are Alfred Bester and Iain Banks?"},{"question":"Who had a solo career, Paul Carrack of Charlotte Wessels?"},{"question":"What ethnic group does the incumbent who was challenged by R.J. Harris in the 2010 for the  Republican Party nomination  in the primary election for Oklahoma's 4th congressional district?"},{"question":"Which magazine was published first, Air Enthusiast or Air International?"},{"question":"Producers that won in the 24th Hong Knog Film Awards?"},{"question":"Johnny English and the killer cleaner were in what installment of the Johnny English film series?"},{"question":"The actor tha plays Jules Maigret in the ITV serial \"Maigret\" plays a supporting role in a 2003 film starring Dylan Moran that was directed by who?"},{"question":"What is the title of the \"SCTV\" sketch and the subsequent Canadian comedy album featuring the actors  Rick Moranis and Dave Thomas?"},{"question":"What is the name of the country whose capital is in the north-east and birthplace of footballer, Khama Billiat?"},{"question":"Beside the one at Magic Kingdom Walt Disney World, what other theme park would one find the \"Happily Ever After\" firework\/projection mapping across Cinderella Castle?"},{"question":"Compass was produced by a record producer that is known primarily for working with who?"},{"question":"What actress played supporting roles in the movie \"Shout\" and the movie \"Swingers\" featuring Vince Vaughn?"},{"question":"Are either Frank Herbert and Paul Auster Australian?"},{"question":"Which Mallrats actress also stared in the comedy Police Academy: Mission to Moscow?"},{"question":"Which ReDRagon member was born on March 1, 1987 ?"},{"question":"Who starred as Brian Tanner in the 1990 American sitcom ALF?"},{"question":"Are both Yasunari Kawabata and Antonin Artaud from the same country?"},{"question":"\"Faith\" by Stevie Wonder is the lead single from a sountrack for a 2016 film directed by who?"},{"question":"What is the official name and code of the team Ernst Willimowski played for besides Poland when he played for them?"},{"question":"Where was the Northern Pacific Depot built after the previous depot was destroyed in the 200000 acre fire on September 1, 1894?"},{"question":"What is the journal that has an editor that is from a university that is part of PASSHE?"},{"question":"Keri Collins and James Kerwin are both what?"},{"question":"What was the larger conflict surrounding the revolt led by Ralph de Gael?"},{"question":"Which team won the 1914 championship of the Big Ten Conference? "},{"question":"Reunion is a sculpture by a man born in what year?"},{"question":"Who won the championship the same year that Sevilla Fútbol Club failed to qualify for European competition?"},{"question":"Which university in the United States contains the only law school in the state and also had American basketball player Larry Moffett play for them?"},{"question":"Who was the county named for in which the unincorporated community call Cockrell is located?"},{"question":"Were both Nine Black Alps and Brand New formed in 2000 or later?"},{"question":"WHat German-born French composer created the operetta La Grande-Duchesse de Gérolstein?"},{"question":"The Wolf of Wall Street starred the actor who starred in what American sitcom?"},{"question":"Which ran longer Arizona Canal and Allegheny Portage Railroad"},{"question":"Which of the following won the 2001 GMA award for \"Male Vocalist of the Year\": ICS Vortex or Mac Powell?"},{"question":"Which is from farther south, Incubus or Crash Test Dummies?"},{"question":"Edmund Veesenmayer served under a senior the highest ranking officer in which part of the Nazi German army?"},{"question":"Which magazine is published in more countried, Womankind or Rabotnitsa?"},{"question":"As of June 27, 2014, the United States Route 15 going through New York State was redesignated as what motorway, running from central Pennsylvania through southern New York?"},{"question":"What role does Ghanashyam Nayak play in India's longest running sitcom serial?"},{"question":"Are the Nicandra genus and the Calpurnia genus both in the Fabaceae family?"},{"question":"One of the most prestigious watch manufacturers founded by a French horologist is located where? "},{"question":"What type of media does When the Levees Broke and Mala Mala have in common?"},{"question":"Batman: Knight Gallery was a comic book that featured art from the artist best known for work on what two other comics?"},{"question":"Who is considered one of the central founders of the science of thermodynamics and is one of the people that the Clausius–Mossotti relation was named after?"},{"question":"Where is the band who released the live DVD Funeral Marches and Warsongs from?"},{"question":"Are The Makropulos Affair and From the House of the Dead both written by Leoš Janáček?"},{"question":"Cloud Nine featured the Irish band originally known by what name?"},{"question":"Jean Martinelli was the star of an Alfred Hitchcock film set in what resort location?"},{"question":"Somos tú y yo is a Venezuelan telenovela filmed in Caracas, Venezuela and developed by which cable and satellite television channel owned by Turner Broadcasting System, a unit of Time Warner and its main flagship channel of Cartoon Network Asia?"},{"question":"When was the school that John O. Schwenn worked at established?"},{"question":"which English actor, comedian, screenwriter, has Rebecca Ferrand worked alongsid with "},{"question":"Who does Óscar Pérez Rojas currently play for?"},{"question":"Are the magazines Sunset and Chesapeake Bay Magazine published with the same frequency?"},{"question":"The two children of Cassius Marcellus Clay Sr. and Odessa Grady Clay was a three-time World Heavyweight Champion and who?"},{"question":"Who was Empress of Japan prior to Empress Michiko, the current Empress?"},{"question":"Which genus has more species Tetradium or Schlumbergera?"},{"question":"The studios of WBLI are located in what New York county?"},{"question":"What spin-off of \"All That\" aired on a two-hour programming block on the American cable television network Nickelodeon, geared toward older (preteen to teen) audiences?"},{"question":"Ian MacKaye and Martin Johnson were both what in the rock bands?"},{"question":"Bailey Hall was built by the same architect as that who created the building that goes by which other name?"},{"question":"What Former American football player who was a highly touted and sought-after college football recruit and played for Oklahoma also played for the 1990 Los Angeles Rams?   "},{"question":"Afshin Zinoori dubbed over the voice of which actor who made his debut on David Copperfield?"},{"question":"What Jerusalem location was part of the naming of the city where the National Naval Medical Center stands?"},{"question":"Preacher was an adaptation of the comic book written by the writer of what nationality?"},{"question":"Which television station licensed to Kansas City, Missouri is adjacent to television station KCPT?"},{"question":"Which atmosphere might be enjoyed in a place that serves Jaz Beer?"},{"question":"Albert Anthony Iafrate and Zdeno Chára both set a record for? "},{"question":"What was the name of the last woman that Eddie Fisher of \"The Eddie Fisher Show\" was married to and had two daughter with?"},{"question":"In what city is the college preparatory private school where the author of the novel featuring symbologist Robert Langdon and cryptologist Sophie Neveu located?"},{"question":"What is special about the African-American cultural and educational center the descendants of enslaved Africans from South Carolina attended?"},{"question":"At what university have both Tamar Gendler and Vincent Scully worked?"},{"question":"What city is 560 m above sea level in Singapore and the birthplace of Parag Dahiwal?"},{"question":"What album was released by Top Dawg Entertainment and contains lyrical themes delivered by rasism and medication tolerence."},{"question":"What 'instrument' do both Sigurd Wongraven and Tina Turner play\/use to perform?"},{"question":"What do Freedomland U.S.A. and Baychester both have in common?"},{"question":"What was the nationality of the costume designer of Homage to the Queen"},{"question":"Where is the institute formerly directed by food technologist Vishweshwaraiah Prakash located?"},{"question":"What was the name of the German team that featured Robert Garrett and the 7ft power forward from the Dallas Mavericks?"},{"question":"Who is older, Caroline Wozniacki or Jared Palmer?"},{"question":"The Wright 3 is a novel about the characters trying to save a landmark that was designed by what architect?"},{"question":"Of the two documentaries Crazy Love and The Life of Mammals, which was filmed after 2004?"},{"question":"What area is known as the \"Isle of 8 Flags\" and is home to the Fernandina Beach Historic District?"},{"question":"What gender does Steve Sarkisian and Mike Connors have in common?"},{"question":"How far away from Marsciano is Perugia?"},{"question":"Denise Richards Played Ross Geller's cousin on a tv sitcom created by who?"},{"question":"Concertos for Four Violins was composed by this man who went to University to study law?"},{"question":"Where is broadcaster of World Have Your Say headquartered?"},{"question":"Are Josh Franceschi and Lars Frederiksen in the same band?"},{"question":"What sport was the multi-purpose stadium in which the 1992 Peach Bowl took place originally built to attract?"},{"question":"John Campanius was a Lutheran priest assigned to a colony established during what devastating war?"},{"question":"Where was the actress who played the Priest's niece born?"},{"question":"Shari McEwen admires a civil rights activist born in what year?"},{"question":"Are both A Midsummer Night's Dream and La sonnambula operas?"},{"question":"The actor who played Chino Ho Kelly on the T.V. series \"Hawaii Five-O\" Starred along side his son that played which character?"},{"question":"The famous character brought to America on the ship Lord Ligonier passed away in which year ?"},{"question":"Which person Jim Cassell has been responsible for the development of plays for Premier League club Liverpool and the England national team?"},{"question":"Beyond Our Ken and High Paddock were connected though what?"},{"question":"The Bravados starred what English actress who was born in Paddington, west London?"},{"question":"What work is the keynote speaker at the Future of Freedom Conference in 1969 known for?"},{"question":"Besides a flower delivery network, what other organization is best known by its telegraphic address?"},{"question":"Which of these Asian directors was behind the science fiction adventure film \"Snowpiercer\", Bong Joon-ho or Vincent Kok?"},{"question":"Renaldo James Woolridge placed for what team in the NVA Development League?"},{"question":"A Life Too Short was a biography about the goalkeeper of what nationality?"},{"question":"On what album was Lonnie Melvin Tillis' song written by Bob Corbin?"},{"question":"Best-Lock Construction Toys are compatible with a line of construction toys manufactured by a privately held company based out of where?"},{"question":"What size do Cape Peninsula University of Technology and Alexandria University have in common?"},{"question":"What member of Garin i Giperboloidy was born on June 24, 1963?"},{"question":"The album Wildflower, which includes the song Always on Your Side, is one of ten albums released by which American singer?"},{"question":"\"Hurt\" is a 2009 gothic horror movie starring William Mapother, but what TV series is he most associated with?"},{"question":"Back to the Future: The Ride was previously located at Universal studios where it has since been replaced by that simulator ride based on the animated television series \"The Simpsons\""},{"question":"What Spitsbergen based seed bank serves to protects agricultural diversity in the far north, 1300 km from the North Pole?"},{"question":"When was the university, which the American paleontologist and geologist known for the discovery of Dreadnoughtus, founded?"},{"question":"Nigel Bruce in Coming out Party was best known for his role in what other series?"},{"question":"Frederick Hibbard graduated from which public land-grant university?"},{"question":"The Lake Koocanusa Scenic Byway begins in what county?"},{"question":"Are both Mariqueen Maandig and Pelle Almqvist from the same country?"},{"question":"Were Subhash Ghai and Nora Ephron both in the film industry?"},{"question":"The Mother first appears in the episode that is part of which season of \"How I Met Your Mother\"?"},{"question":"Who has the highest scope of profession in  Dirk Frimout or André Kuipers"},{"question":"What is the sport that Henrik Sedin and Daniel Sedin played together throughout their careers ?"},{"question":"Kewanee is how many miles west of the only east-west Highway connecting Mexico and Canada?"},{"question":"Who is this American politician and academic who got elected as President of the United States after becoming nominee at the Democratic National Convention in Baltimore, Maryland?"},{"question":"Xestaspis paulina is endemic to a country that is located northeast of where?"},{"question":"Are Thurston Moore and Pharrell Williams both rappers?"},{"question":"The crown name after Edward the Confessor is one of the oldest Crown Jewels of England, or now known as what?"},{"question":"What type of person does Deirdre Connelly and Andrew Witty have in common?"},{"question":"Which former Governor of Arkansas was elected president the same year as the United States Senate elections in 1992?"},{"question":"What is the river 3 mi north-west of Gainsborough said to take its name from?"},{"question":"Who is Claudio Ranieri in reference 1996–97 A.C. Fiorentina season?"},{"question":"What company owns brand of goal tending equipment endorsed by former head coach of the Colorado Avalanche? "},{"question":"Jonathan Smith's song is one of three covers on an album released by what group?"},{"question":"What football team represented the University of Oklahoma and was featured as  #11 (BCS ranked) on the The 80th annual Sugar Bowl?"},{"question":"Which alternative rock band was founded first, Galaxie 500 or Sponge?"},{"question":"Which of Adelaide Metro's stations is located at the base of the Mount Lofty Ranges?"},{"question":"The top brand of beer in North Korea is brewed by which company ?"},{"question":"Which actress was nominated for three Tony Awards and played the character of Mollie in Take Her, She's Mine?"},{"question":"Nico Constantine is an American music director that is known for his work with this rock band from Atlanta, Georgia?"},{"question":"Change is Now: Renewing America's Promise includes previously released tracks from an American hip hop recording artist who debuted in 1992 with what album?"},{"question":"Where was the band which went along with Ludichrist  formed?"},{"question":"What award, included in the term EGOT, did A Chorus Line win?"},{"question":"When is the tennis tournament held annually in which Bernard Tomic reached the fourth round in 2012, 2015 and 2016?"},{"question":"What is another name for a Garryowen, the kick John Peard is famous for?"},{"question":"What group released a song inspired by Debbie Harry from the band Blondie as well the song \"Love Shack\"?"},{"question":"Powder Room is a film that stars an actress of what nationality?"},{"question":"What artist did Kanye West produce singles for that was supposed to use album beats produced by DJ Premier?"},{"question":"What is the nickname of the airplane model flown in Malaysian Airlines Flight 370?"},{"question":"Which magazine is published more foten, Darling or Femmes d’Aujourd’hui?"},{"question":"Between The All-American Rejects and Chvrches, which band has Lauren Mayberry as its lead vocalist?"},{"question":"What type of facility was Roger Batzel best known for as director?  "},{"question":"Was Atomic Ed and the Black Hole or Giuliani Time released first?"},{"question":"What year did the band who had a top 40 hit in the UK and a promotional video directed by Spike Jonze have a reunion tour?"},{"question":"What country does Rand Show and Johannesburg have in common?"},{"question":" Montrose Regional Airport a public airport as opposed to Luis Muñoz Marín International Airport which is what?"},{"question":"Who wrote the screenplay for a movie featuring ChristIan bale?"},{"question":"Bad Kostritz and the Kostritzer brewery are located in what country?"},{"question":"In which country was the author of  \"A Method for Prayer\" born ?"},{"question":"What was succeeded by the Aston Martin DB6 and was released in 1963?"},{"question":"Are Prevention and Drum! both American magazines?"},{"question":"Aaron S. Rosenberg, an American novelist and game designer, wrote what fantasy novel? "},{"question":"What country leads the ranking system that was used to calculate the seeding for the 2006 FIFA World Cup?"},{"question":"Which school in the Kansas Unified School District 233 has the Owl for a mascot?"},{"question":"Which airport is closer to the city, Gerald R. Ford International Airport or Grand Canyon West Airport?"},{"question":"In what year was the album released that had That Ol' Wind as the sixth single?"},{"question":"Both Brian Warren and Jake Shields are considered what?"},{"question":"Which of the town in which Borough of Broxbourne council is based is a town in the Broxbourne borough of the English county of Hertfordshire, situated in the Lea Valley?"},{"question":"The Cheakamus Valley basalts are part of what southwestern British Columbia formation?"},{"question":"Which is the largest airport which serves Sauce Viejo Airport?"},{"question":"Are both Diamond v. Chakrabarty and Gates v. Collier United States Supreme Court cases?"},{"question":"Who is noted for their work on the history of Egypt's largest Christian church?"},{"question":"What was the score of the National Football League (NFL)'s champion Green Bay Packers first overall Super Bowl victory since the Orange Bowl?"},{"question":"Who is from farther west, Sunye or Alex Chilton?"},{"question":"Which system is most likely to have impacted current computer technology, Atari or Comx-35?"},{"question":"What main thoroughfare in Warsaw's borough of Ursynów connects to a 6,500 km international road which coincides with the Trans-Siberian Highway?"},{"question":"Were Songyuan and Shulan in the same province in China?"},{"question":"Who starred in the film that opened the 48th annual Berlin International Film Festival?"},{"question":"The eight part British television series \"Rhodes\" is based on the life of a man who was Prime Minister of what then-British colony?"},{"question":"The 1998 American horror film produced and directed by Gus Van Sant was a remake of a film that had an actress win what Golden Globe Award?"},{"question":" Both Roulette and Game of the Goose are what?"},{"question":"In 1017 Gervonta Davis was ranked as the world's sixth best boxer in the division by what magazine owned by Golden Boy Enterprises?"},{"question":"What did the first book of Gary Zukav explore ?"},{"question":"How long is the monorail that has a platform 2000 feet away from Caesars Palace?"},{"question":"Which character is married to the Vision but also the daughter of Magneto?"},{"question":"What countr is Raquel Welch from when she acted on the show Bandolero!?"},{"question":"In regards to the Mexican American country music artist who signed with Columbia Nashville in 1993, what was his only number one single on the Billboard Hot Country Singles & Tracks chart?"},{"question":"Is Appleton International Airport or Lihue Airport further north?"},{"question":"The city where Intesa Sanpaolo is based is the capital city of what region in Italy?"},{"question":"Which college football team that is currently a member of the Big Ten Conference, once had Canadian football player, Jason Nugent, play for them?"},{"question":"Which drink would be more likely to be served at a wedding, Mimosa or Blow Job?"},{"question":"When was the last film in the series \"American Pie\" released?"},{"question":"Does Paramount Plaza or Times Square Tower have more stories?"},{"question":"The Chinese men's national under-20 ice hockey team plays in the events traditionally held in what month?"},{"question":"What city in New York, previously known as Little Cow Harbor, has the historic John Harned House?"},{"question":"Matt Schultz is the lead singer of a band from which state?"},{"question":" Winston Churchill and Joseph Wambaugh were both what?"},{"question":"Who was born first, Reginald Denham or Jack Conway?"},{"question":"What year was the murderer of the Princes in the Tower born?"},{"question":"When did the cover athlete for the video game NHL 12 win the Maurice Richard Trophy?"},{"question":"Who is the actor that appeared in both Small Apartments (2012) and the SBS comedy series Pizza?"},{"question":"Are Li Yang and Mark Robson both Chinese directors?"},{"question":"The Hills Have Thighs was based on the movie The HIlls Have Eyes that was released on what date? "},{"question":"Who is Israeli illusionist, magician, television personality, and self-proclaimed psychic that appeared in the NBC TV show Phenomenon along side Criss Angel and hosted by Tim Vincent ?"},{"question":"Passu Sar and Trivor are mountain peaks in what country?"},{"question":"Which Portuguese winger played beside  Zlatan Ibrahimović in the 2008-09 Inter Milan team ?"},{"question":"Which was founded first, Foreign Policy or Domino?"},{"question":"The Dutch guilder is the currency of the country that has what type of governmental system?"},{"question":" Fabrizio Ciano was the son of a foreign minister who left behind a diary that was used in an HBO documentry-drama entitled what?"},{"question":"Bill Nye hosted a self-titled show, which was predecessor to \"The Eyes of Nye\"; what was the final air date of that predecessor show?"},{"question":"What actor played the role of Michael Stivic on \"All in the Family\" and also starred in The Wolf of Wall Street?"},{"question":"The Minneapolis-St. Paul Airport Trams and the airport also known as World Chamberlain Field were both constructed by whom?"},{"question":"When did the person who ruled over Per Stålhammar have rule?"},{"question":"What full service law firm has the Congressman who won re-election in Florida's 21st district in 2012 been affiliated with?"},{"question":"Which group that employs nearly 6,800 employees is the largest share holder of Nordea?"},{"question":"Nine-card Brag is just one of the varying ancestors to which card card game?"},{"question":"Which Oscar- and Emmy-nominated English actor starred in the 1982 British romantic adventure film \"The Scarlet Pimpernel\"?"},{"question":"Who is younger, Paul Meany or Nigel Clark?"},{"question":"The Treaty of Fort Harmar was an agreement between the United States government and numerous Native American tribes with claims to what post-AMerican revolutionary War territory northwest of the River Ohio, and that legally existed from July 13 1787 until March 1, 1803?"},{"question":"Which Centre did the author of \"The Strange Death of Europe\" found?"},{"question":"Who has won more awards for their work, Darren Benjamin Shepherd or Lilibet Foster?"},{"question":"Which character did Bill Melendez voice who was a pet beagle?"},{"question":"The cheap gold jewelry in which a Cockney Wanker wears is manufactured by a catalog retailer that is a subsidiary of which company?"},{"question":"Both Canadian and American Chinese Cuisine were influenced by what particular immigrants?"},{"question":"How many minutes did the current goalkeeper for Borussia Dortmund remain unbeaten at his previous club?"},{"question":"Are Charles Olson and Gay Talese both poets?"},{"question":"Was the commissioner of the building Brenda A. Levin worked on? "},{"question":"In addition to the individual born in October 1959, who else helped produce the studio album Featuring Songs from Their Television Show?"},{"question":"The actress of the ex-wife of St. John in \"No Such Thing as Vampires\" has appeared in what other films?"},{"question":"Does Remy Zero have more members than Skunk Anansie?"},{"question":"This star of Ayal Njannalla was an actor and what else?"},{"question":"The 2015 film starring an actor whose debut was in the television series White Christmas was directed by whom?"},{"question":"When was the British statesman under which Peter Kirk was a minister in his government born? "},{"question":"Solely based on the given paragraphs above which band has released more albums, Rammstein or Chiodos?"},{"question":"Which civil unrest (protests) led to this armed conflict in 2011 in Libya during which Arrai TV was used by overseas Libyans to defend the Gaddafi government?"},{"question":"Clic is a 1974 album whose music has stylistic similarities with an American composer widely regarded as one of the most influential musicians of what?"},{"question":"Who produced the  television series  to which Brett Gelman for his roles?"},{"question":"Of Herbert Achternbusch an David Seltzer, which lived closer to Canada?"},{"question":"Sir Francis Nethersole was secretary to an Electress that is often referred to by what nickname?"},{"question":"Who starred in Where'd You Go, Bernadette and is the daughter of the producer Donald P. Bellisario?"},{"question":"The Argentine city Crespo holds an annual beer festival based on a German festival that began in what year?"},{"question":"Tay Garnett and Alexander Kluge both have what job?"},{"question":"Who was an enemy of the fictional character worked on by Esad T. Ribic that was the adoptive brother of Thor?"},{"question":"In what year did William \"Gipsy\" Daniels knock out the future heavyweight champion of the world?"},{"question":"Are Beth Gibbons and Ian Curtis the same nationality?"},{"question":"Matthew Trupiano was the boss of which St. Louis group?"},{"question":"In which province did percussionist Masaki Tanazawa perform in on 7 November 1985?"},{"question":"Which of those that anchored \"The Collection at RiverPark\" is an American specialty retail chain company that operates The Container Store, which offers storage and organization products?"},{"question":"The books in which Caras Caladhon is a fictional city have sold how many copies?"},{"question":"Wiremu \"Bill\" Whareaitu represented New Zealand in the commonwealth games held on which dates ?"},{"question":"The Schuylerville Stakes is held annually at a horse racing track in which Saratoga County town?"},{"question":"The album that 808s & Sax Breaks is a jazz interpretation of was released in what year?"},{"question":"What is the birth date of the composer who created the opera the Consul? "},{"question":"In what year was Bradley Orr's football playing nephew born?"},{"question":"Otto Dickel became a proponent of laissez-faire capitalism which translates to what?"},{"question":"This song, which got heavy rotation on MTV was written by Sebastian Bach, Rachel Bolan and a rock guitarist in what kind of band?"},{"question":"Who co-directed the eight-episode Danish television mini-series that the American paranormal hospital drama, All Souls, was based on?"},{"question":"What is the co-founder of The Alliance for Lupus Research currently serving as?"},{"question":"What is Anthony Stark trying to do with Amahl Farouk?"},{"question":"In which island the  RCC Broadcasting Company broadcasts?"},{"question":"Which band has more members, Saint Motel or Curve?"},{"question":"What tour grossed 75 million dollars and was also the name of Michael Jackson's sixth studio album?"},{"question":"Where is the UK band from who's single is \"Unfinished Business\"?"},{"question":"What was the first flagship sedan of the class of Mercedes-Benz which preceded the Mercedes-Benz CL-Class?"},{"question":"Bazigit Atajev and Tsuyoshi Kohsaka are both what type of athlete?"},{"question":"Football Under Cover and 10 MPH are both what type of films?"},{"question":"Who is older, Tsuyoshi Kohsaka or Antônio Silva ?"},{"question":"Sorghum × drummondii is a type of grass harvested for what type of edible fruit?"},{"question":"Which chain was founded first, Blaze Pizza or Marion's Piazza?"},{"question":"Who was born first Mike Judge or Albert S. Rogell?"},{"question":"How many people are employed by the company operating the Varsseveld railway station?"},{"question":"Se ilden lyse (in English: Fire In Your Heart) is a single from which Norwegian soprano?"},{"question":"what is the largest university press in the world that published Oxford Companions?"},{"question":"How many episodes were there of the show where Raven Goodwin played Tangie Cunningham?"},{"question":"Which university has more colleges within the school, University of Alabama in Huntsville or University of North Texas?"},{"question":"One of the founders of lastminute.com is known as a philanthropist, a public servant, as well as a...?"},{"question":"Who is older, John Fitzgerald or Andy Murray?"},{"question":"Bianca's Smut Shack became a popular theme camp at annual gathering held at which city ?"},{"question":"What is the another name for the singer of Standing Hampton?"},{"question":"Fünf Minuten Amerika and Felix Salten both were creators of what media?"},{"question":"Which magazine prvides information on nurtrion, Prevention or Bloomberg Businessweek?"},{"question":"Which five uniformed services of the United States are eligible for the National Defense Service Medal?"},{"question":"The Taxpayer Choice Act was supported by a U.S. Representative from what state? "},{"question":"What is the film that Shuna Harwood was nominated for an Academy Award for adapted from?"},{"question":"Chiquitita had lead vocals from the singer who was part of the group which has sold how many albums and singles?"},{"question":"Which successful American immigrant was born most recently, Varaz Samuelian or Samuel Der-Yeghiayan?"},{"question":"To what country did Iannis Xenakis flee in the same year that Mark Kidel was born?"},{"question":"Where does the team Rick Bennett coaches play?"},{"question":"Are both Lydia Zimmermann and Miranda July Canadian film directors?"},{"question":"Morning Glory starred the American actor who is a regular on what Showtime\/BBC series?"},{"question":"Who ordered Jewish people to be sent to Nazi concentration camps as described in the book The Lost Childhood, in March 1933?"},{"question":"Which Soviet mathematician was born first Nikolay Bogolyubov or Israel Gelfand?"},{"question":"How populated is this minor civil division in Maine, of which The Forks, Maine is a good example?"},{"question":"Renée Montagne succeeded which American broadcast journalist, a Peabody Award-winning member of the National Radio Hall of Fame?"},{"question":"Who is a ficitional superhero that appeared in DC Comics and had Rama as a potential love interest?"},{"question":"Was Nick Heyward a better guitarist than Yeo Hoon-min?"},{"question":"In which issue did this fictional superhero in the DC Comics Universe, who was killed by Captain Cold, make his first full appearance?"},{"question":"Rome was named the 4th most desirable city to visit in the world in a 2007 edition of a magazine based in what city?"},{"question":"What is the nationality of the person who Space Art opened for in 1981?"},{"question":"What historic site in Macon County was supplied by Lucius B. Northrop?"},{"question":"David Lane of The Order encourages white nationalists to move to which 5 states?"},{"question":"Solider's Home starring actress started her career when?"},{"question":"Killing Mr. Griffin starred an actress born October 6 with what nationality?"},{"question":"Who wrote Elephant Stone with the song writer John Squire?"},{"question":"Alfred Sherman became an adviser to a Prime Minister of the United Kingdom that died in this year?"},{"question":"The Airdrome Dream Classic uses what visual arts style?"},{"question":"Uwajimaya had a store from 1968-91 in the shopping mall in what Washington city?"},{"question":"Michael Sandberg, Baron Sandberg was the executive chairman of what largest bank of Hong Kong?"},{"question":"Who was President of Argentina when César Augusto Guzzetti became the first foreign minister of the military government?"},{"question":"When did the politician who represented the electoral district in Sydney's West resign from his political party?"},{"question":"Are Veronica and Ulex both in the flowering plant family?"},{"question":"Who was born in Barry, Wales and was involved in the E-borders programme?"},{"question":"What city was Joseph Druces victim working in?"},{"question":"What company headquartered in Kowloon, Hong Kong has Yvan Rodic contributed to?"},{"question":"What gang were Buck Barrow and Blanche Barrow apart of?"},{"question":"How many nations participated in the Winter Olympics where Jesse Väänänen placed 22nd in the individual sprint event?"},{"question":"Which rocket propelled weapon, sometimes referred to as the \"Stovepipe,\" did Colonel Leslie Alfred Skinner help develop?"},{"question":"Who was this Mughal Emperor that reigned nearly half a century whom Saadat Ali Khan I fought alongside with against the Maratha in the Deccan?"},{"question":"What was Eannatum's name known as for the ancient semitic-speaking people from Syria?"},{"question":"How does Hilton Singapore connected to an adjacent Hotel which belongs to a Canadian international luxury hospitality company headquartered in Toronto, Ontario?"},{"question":"The bassist for Marianas Trench and Alice in Chains share what common first name?"},{"question":"Where is the suburb of the racetrack which supplanted the Camden Motordome?"},{"question":"What is the elevation range for the area that the eastern sector of the Colorado orogeny extends into?"},{"question":"Which continent were the Australian Shepherd and the West Highland White Terrier breeds' ancestors located in?"},{"question":"Which largest city of the Indian state of Rajasthan in Western India is the capital of Rajasthan"},{"question":"What Lakota Tribe Reservation was Dolly Akers affiliated with?"},{"question":"Waltz #2 is a song by what Nebraska singer-songwriter with a distinctive vocal style?"},{"question":"How many residents are there in the city that the band \"The Shadows of Knight\" are from?"},{"question":"What name did Patrick Keeler's The Racounteurs use in Australia?"},{"question":"What ingredient of Yumil-gwa, in a botanical context, implies that the shell is indehiscent?"},{"question":"Which of Time magazines 100 most influential people in the world made a guest appearance in Billu?"},{"question":"The 9th AVN awards ceremony took place in a hotel formly known as?"},{"question":"What county is Cleavland School district based in?"},{"question":"What fictional antihero from comic books published by DC Comics, who sometimes acts as a cab driver, was created by Alan Moore, Steve Bissette, and John Totleben?"},{"question":"What city was a founder of the The National Basketball Retired Players Association the mayor of?"},{"question":"What media commentator and businessman won the XII Race of Champions?"},{"question":"Considering the Porsche 928 and Porsche Cayenne.  Which of the two vehicles was exclusively manufactured before the 21st century?"},{"question":"Who did the actor who played J.D. Salinger in Coming Through the Rye play in Lonesome Dove?"},{"question":"The third largest inland port in Australia during the great river boat era of the mid-19th century is west and north-west to an area in a county in New South Wales that has what River as it's north-west boundry?"},{"question":"Which two units of government jointly share a ministerial position formerly held by the conservative MP from Hemel Hempstead?"},{"question":"Favre Lake can be found in what corner of the state of Nevada?"},{"question":"What structure did the Annie C. Maguire hit in the Gulf of Maine?"},{"question":"The Mexican Kickapoo also have a tribe in this state, home to one of three Federally recognized tribes of Kickapoo people?"},{"question":"What position is currently held by the husband of Brigitte Macron?"},{"question":"John Sandeman Allen was part of the South Norfolk constituency in the UK general election held on what date?"},{"question":"In what city did Lester Everett Lyles play for the New York Jets?"},{"question":"The empire that Ayurbarwada Buyantu Khan was the eighth Great Khan originated where?"},{"question":"What was the last album U2 released before the song Breathe?"},{"question":"This famous baseball player played the same position as his older brother, Vince, and was best know. For a hitting streak that still stands today "},{"question":"What is the occupation of the first wife of Robert Kardashian?"},{"question":"when was the Australian rules football club in which Greg Taube played for extablished "},{"question":"Are Ms. and Fucsia targeted at the same gender for their audience?"},{"question":"Name the songwriter from San Francisco who operates the Art of Ears Studio and who worked with the lead vocalist for the hip hop group Digital Underground?"},{"question":"Are Hinduism Today and Star Wars Insider both magazines?"},{"question":"George Herbert Jose was a canon of what cathedral in South Australia?"},{"question":"Who developed the game that features Somebody New on its soundtrack?"},{"question":"What type of media does Lion and Rooney Mara have in common?"},{"question":"The Mechanicville Bridgecarries New York State Route 67 across the Hudson River in New York connecting Mechanicville with Hemstreet Park in which town in Rensselaer County, New York, United States?"},{"question":"What was the name given to a series of pre-Christmas toyshop incidents in the United States in 1983? "},{"question":"What weekly newsmagazine is published in the capital and largest city of Peru?"},{"question":"Who was the director of the 2012 American musical comedy film starring the actress who owns the fashion line \"Hanamahn\"?"},{"question":"Diego Schwartzmann won the annual finals tournament in 2014, but failed to qualify to defend it in 2015, at which sport?"},{"question":"Both the Pyrenean Mastiff and the Braque d'Auvergne are what?"},{"question":"Who created the record company that released the Strokes' debut studio album?"},{"question":"What 2012 award was won by the writer of the \"Smile\" episode of the \"Doctor Who\" television series?"},{"question":"Who directed the 1987 romantic drama dance film that is directly parodied by the television film \"Totally Awesome\"?"},{"question":"What award did Scarlett Johansson win from starring in the 2003 film \"Girl with a Pearl Earring\"?"},{"question":"In which country are Wellingrove, New South Wales and Glen Innes, New South wales located?"},{"question":"What year did the recorder of Young Man Mose die?"},{"question":"Who was the goalkeeper who blocked the most decorated English footballer player of all time?"},{"question":"What did Susan Gottesman aid in the main research purpose at NCI?"},{"question":"Where is the maker of Citrus Hill headquartered?"},{"question":"Bullseye is a character who has a vendetta against the superhero appearing in comics by which company?"},{"question":"Which airport is closer in proximity to Richmond County, Georgia, Augusta Regional Airport, or Wichita Dwight D. Eisenhower National Airport?"},{"question":"When did the children's Indian television series in which Anushka Sen was popularly known started to broadcast? "},{"question":"What was the army rank of Mildred Gale's grandson?"},{"question":"What was the book about which Paul R. Gross written with Barbara Forrest in 2004?"},{"question":"Which Sustainment Brigade descended from an infantry regiment of the New York Army National Guard?"},{"question":"Who's army was Sanite Belair a member of during the Haitian Revolution?"},{"question":"Did Andrei Platonov or Alice Walker win more Pulitzer prizes?"},{"question":"Where in England does Maxime Teremoana \"Max\" Crocombe play football? "},{"question":"What was the contribution of the \"quiet Beatle\" to a song Ian McDonald described as having \"rich and unusual harmonic motion\"?"},{"question":"Jason Hooten is the head coach of the Men's Basketball team at a public institution of higher learning founded in what year?"},{"question":"How many feature films has the Irish-American actor who appeared in \"Frankenstein\" (1994) and \"Practical Magic\" 1998 starred in"},{"question":"Who was born second, Anita Shreve or Guillaume Apollinaire?"},{"question":"In which period the son of John Hunyadi was a King of Hungary and Croatia?"},{"question":"What characteristic is shared by Deadpool and Taskmaster? "},{"question":"In what year did a Soviet, Russian, and American theoretical physicist, whose main contributions are in the field of condensed matter physics, come up with his famous theory?"},{"question":"The Filipino theme park known as EK features the Space Shuttle which is what kind of ride?"},{"question":"The Logie Awards of 1998 featured guests including one of the stars of what popular NBC sitcom?"},{"question":"The album by Silver Jews featuring an American musician best known for being the lead singer in Pavement was recorded where in Brooklyn?"},{"question":"In which iteration of the Miss Universe pageant will Elizabeta Burg represent Croatia?"},{"question":"Are Hilton Head Airport and Mammoth Yosemite Airport both public airports? "},{"question":"Who was the author of the novel which was the basis for the 2011 film of the same nae which starred the actress whose screen debut was in the television film \"Replacing Dad\"?"},{"question":"What type of gesture does Donets-Krivoy Rog Soviet Republic and have in common?"},{"question":"Which drummer was Roger Daltrey's solo album, \"Under a Raging Moon\" dedicated to, who was also posthumously inducted into the \"Modern Drummer\" Hall of Fame in 1982?"},{"question":"Which ride, at a San Diego amusement park, mimics whitewater rafting?"},{"question":"Which magazine is more informative National Geographic or Men's Fitness?"},{"question":"Who's musicall style includes more than one style, Sammy Hagar or Kevin Rowland?"},{"question":"Which group released the album Good Morning Vietnam 2: The Golden Triangle which features samples from the film \"American Gangster\"?"},{"question":"What was the birth name of the actress who co-starred with Fred Astaire in \"Royal Wedding\"?"},{"question":"What city has the greatest population, Tongxiang or Yulin, Shaanxi?"},{"question":"Colin Campbell was replaced as NHL Senior Vice President by which president of the Toronto Maple Leafs?"},{"question":"Saint Vitus and Pentagram had what in common when it came to the music industry?"},{"question":"Royal Crescent is a crescent-shaped terrace of houses has been placed on what?"},{"question":"Jonas Rivera's film, Inside Out, was released in 2015 by which studio?"},{"question":"Which village within the town of York, Maine was the filming location for the final film role of Colleen Dewhurst?"},{"question":"Baleine, Nova Scotia is best known as the landing site for a pilot born in which year ?"},{"question":"David Boris Pall founded a corporation located where?"},{"question":"What city in France has a hall named after the commander of the American Expeditionary Force  on the Western Front in World War I?"},{"question":"We Need a Little Christmas was first performed by what British-American-Irish actress whose career has spanned seven decades?"},{"question":"Which of the following is a home computer designed by Radofin and released in 1983: Mattel Aquarius or Tandy 1000?"},{"question":"Which cricketer is the younger brother of Jack Lindwall and played top-flight rugby league football with St. George?"},{"question":"Retired pro wrestler John \"Bradshaw\" Layfield created The Cabinet as a pro wrestling stable as part of what WWE brand?"},{"question":" Tim McGauley is currently playing for the longest continuously operating member club of the league still playing in what?"},{"question":"When I've Been Drinkin' was cowritten by what American Country singer born in 1985"},{"question":"Geary County, Kansas is named after what Civil War union general? "},{"question":"who died first Arthur Wahl or Glenn T. Seaborg ?"},{"question":"Among two literary figures, Robert Stone and Paul Heyse, who was born earlier?"},{"question":"The show \"O\" at the Bellagio is located in what city?"},{"question":"Are a Fuzzy navel and Pastis both alcoholic beverages?"},{"question":"Who is the director of this 1977 American musical drama film starring Adrienne King and John Travolta?"},{"question":"Who did Charles Everett Lively assassinate during a series of armed labor conflicts in the United States, roughly between 1890 and 1930?"},{"question":"Jeanette MacDonald and Maurice Chevalier famously made many films in the 1930s. In which one did she play a princess?"},{"question":"What developer of the Bragg–Gray cavity theory was knighted in 1920?"},{"question":"Which movie is based on a book, Darby O'Gill and the Little People and College Road Trip?"},{"question":"What cartridge was developed in 1910 and is currently used in the M2 machine gun? "},{"question":"What animal first described by the Sri Lankan zoologist Deraniyagala is found at Yala National Park?"},{"question":"What countries have land borders with the country which Johannes (Juho) Lepistö served as member of Parliament?  "},{"question":"The Wrestlers is a grade II listed public house on on a read linking between which cities ?"},{"question":"Of the film directors Kenji Mizoguchi and Andrzej Żuławski, which one often went against mainstream commercialism in his films?"},{"question":"According to a British tabloid founded in 1903, how many signatures were collected for a petition from the Snowdrop Campaign to ban ownership and use of handguns?"},{"question":"What city is home to both the Istanbul Aviation Museum and the Crimea Memorial Church?"},{"question":"What is the birth date of the man who John Frusciante replaced as the Red Hot Chili Peppers guitarist?"},{"question":"Which filmmaker is not German, David Gordon Green or Detlev Buck?"},{"question":"Which cocktail is named for a popular hotel waiter, John Collins or Porchcrawler?"},{"question":"Which award did a actress of No Entry crowned in 1997?"},{"question":"Which Italian restaurant is based in Tennessee, Gino's Pizza and Spaghetti or Pizzeria Venti?"},{"question":"Dovyalis is a genus of shrubs and small trees belonging to the family Salicaceae, whereas Townsendia is a genus of NOrth American plants within what flower family?"},{"question":"What region of Tennessee is Embreeville located in?"},{"question":"Which 1968 Beatles' song, which is written by Paul McCartney but credited to the song partnership Lennon-McCarney, opens the double-disc album \"The Beatles\" and then seques into \"Dear Prudence\"?"},{"question":"Who acts as an analyst for a TV network for Kansas Jayhawks women's basketball team?"},{"question":"Ahmad Kola is in a country with how many inhabitants?"},{"question":"Who is the main character in the animated television series that orginally aired on Nickolodeon and featured the underwater adventures of the this title character and his friends from Bikini Bottom?"},{"question":"What WNBA team formerly played at the location of the Pacers–Pistons brawl?"},{"question":"What show did Chuck Woolery host 1 year before hosting the game show \"Think like a Cat\"?"},{"question":"The father of Bobby Bare Jr made famous the song \"Detroit City\" along with what two other artists?"},{"question":"What is the mountain called that was named after William Barton Rogers and has a summit elevation of 5729 feet above mean sea level?"},{"question":"Edwin van der Sar spoke to the crowd after the fireworks incident on April 20, 2014 during the KNVB Cup final match. Which team won that game?"},{"question":"the star of the film Love from a Stranger is from which country who acted along with Binnie Hale?"},{"question":" \"Big Fish\" is a song from an album released by which record labels ?"},{"question":"Which plant has more species, Ruta or Tobacco?"},{"question":"Sightseek was a horse trained by the trainer inducted into the National Museum of Racing and Hall of Fame in what year?"},{"question":"Christopher Sclater Millard's work was helpful in the estate of which prolific Irish writer?"},{"question":"Which French- and Arabic-speaking country was the first in Africa to air its own version of the TV show \"Deal or No Deal\"?"},{"question":"What is the state in which one of the Quill Foundation's supporters is located?"},{"question":"What banking group, founded in 1818, sponsors Club Sportive Sedan Ardennes?"},{"question":"What NFL team did the host of \"The Challenge\" play for when they won the Super Bowl?"},{"question":"The Old Post Office Block is situated between the stage production venue at 76-96 Hanover Street and which other building?"},{"question":"Perry the Platypus stop the destrustion of all of the lawn gnomes in the  \" Lawn Gnome Beach Party of Terror\" episode of which animated television series"},{"question":"The actress best known for her roles in the West End and Oliver frequented a Music Hall registered for what?"},{"question":"Turbidimetric inhibition immunoassay may be used to test your blood if you have what condition?"},{"question":"Which plant has more species, Microcachrys or Dichroa?"},{"question":"When did the Japenese series Moribito: Guardian of the Spirit first premier of Caroon Network's Adult Swim prgramming block?"},{"question":"Şahan Arzruni was an ethnic Armenian classical pianist whereas Shavo Odadjian was known for what?"},{"question":"When was the company CareFusion is a subsidiary of founded?"},{"question":"Who is older, Langston Hughes or James Agee?"},{"question":"The 2013 California Golden Bears football team had a head coach who played what sport in college?"},{"question":"John of Arsuf was the regent of Jerusalem under which memberof the Hohenstaufen dynasty?"},{"question":"What type of collection does Etarcomol and Medb have in common?"},{"question":"Anne Jacqueline Hathaway stared in a romantic comedy in 2010 which was written by Katherine Fugate, and directed by who?"},{"question":"Which company markets Melarsomine as Immiticide in order to treat a small thread-like worm that causes filariasis in dogs, mainly, but also cats, ferrets, bears, sea lions, and coyotes?"},{"question":"Where Jack Thompson is from and where the Victorian Football League's Collingwood Football Club?"},{"question":"Call a spade a spade has been used in literary works by what British playwright, novelist, and short story writer who was reportedly the highest-paid author during the 1930s?"},{"question":"Bob Scucci formerly worked at a casino located where?"},{"question":" Who was born first, Renáta Tomanová or Travis Parrott?"},{"question":"The artist that released the debut album \"Who Came First\" was the lead guitarist and main songwriter for what band?"},{"question":"Google's rival santa tracker has existed since what year?"},{"question":"What aviator born in 1925 was featured in Rocket Science?"},{"question":"Are both Martin Heidegger and José Echegaray engineers?"},{"question":"What important political role did the female star of the film Talk About a Stranger hold ?"},{"question":"Which anime television series aired 9 October 2016 was adapted by a Japanese animation studio founded by Mikihiro Iwata? "},{"question":"Who logged more hours in space, James P. Bagian or Edward Avedisian"},{"question":"George Newhouse was the Labor candidate for the seat that was first proclaimed in what year?"},{"question":"What local government area oversees the city where the Lake Oval is located?"},{"question":"What type of film was the 2006 comedy film that the host of \"The Andy Dick Show\" wrote\/directed\/starred in? "},{"question":"What is another name for the Mediterranean Theater of Operations, United States Army invasion of French North Africa during World War II?"},{"question":"When was the Australian screenwriter, producer, director and actor born who screenplay the Saw III?"},{"question":"Which happened first, the Battle of the Ch'ongch'on River or the Battle of Guam?"},{"question":"Who wrote the 2011 television drama that Gong Yoo played a role in?"},{"question":"Pudon is the location of a theme park featuring a show called?"},{"question":"Which board game was created in Finland, King Oil or Inkan aarre?"},{"question":"New York State Route 436 passes through a state park 35 mi southwest of what city?"},{"question":"The Lockenhaus Chamber Music Festival has included performances by the solo pianist who has held what country's citizenship since 1972?"},{"question":"When was the governor who appointed Lana Gordon first elected governor?"},{"question":"Which one of these universities founded first - Technical University of Crete and Mongolian University of Science and Technology?"},{"question":"How many bombs were used in the attack that killed Tim and Jonathan Ball?"},{"question":"Were the films Meet the Robinsons and Blackbeard's Ghost both based on novels?"},{"question":"Lutefisk often served at Svensk Hyllningsfest is native to what region?"},{"question":"Which park covers more land area, Sierra Nevada National Park or Atlantic Islands of Galicia National Park?"},{"question":"Which group contains more species, Willow or Stipa?"},{"question":"Which writer and journalist contributing to \"The New Yorker\" writes about subjects such as the Art Deco-style skyscraper, the Chrysler Building?"},{"question":"Renowned MC Rakim appeared on \"Guilty All The Same\" by Linkin Park, and is usually associated with which hip-hop partner?"},{"question":"Anderson Silva has been lauded by the current president of what organization?"},{"question":"What was the name of the fighter jet flown by the subject of John Barron's 1980 biography?"},{"question":"Which profession does Boris Barnet have in common with Baltasar Kormákur?"},{"question":"the club that won the 29th edition of Serie A was founded in which year ?"},{"question":"What is the name of the award named in honor of the English actor who studied at the Royal Academy and had an eight decade career?"},{"question":"Alfred Goldthwaite was an attorney for the party that traces its roots to whom?"},{"question":"Who was the director of the 2012 American horror film, which was the sequel to the 2009 home invasion horror film The Collector?"},{"question":"Nora Roberts High noon is one of how many novels written by the bestselling author?"},{"question":"The 14th Golden Melody Awards was pushed back to August 2, 2003 from the original May date due to what viral respiratory disease of zoonotic origin caused by coronavirus?"},{"question":"What year saw the release of the first album by the boy band featured in a remix of Todo Cambio?"},{"question":"What relationship does Stevie Mann have to an Irish singer-songwriter born in 1973?"},{"question":"How many shops does the larger of the Miami International Mall and Dolphin Mall have?"},{"question":"The Way to Rainy Mountain was a book by the Pulitzer Prize-winning novelist of what heritage?"},{"question":"Which aircraft did ace pilot Gordon Arthur Stanley fly from aircraft carriers during World War II?"},{"question":"The first movie exhibited in the Ottoman Empire was which 1895 French short black-and-white silent documentary film directed and produced by Auguste and Louis Lumière?"},{"question":"Olivia Newton-John has how many more Grammy wins than the number of performers in the Main Event Tour?"},{"question":"Who was the co-star in the movie Mood of the Day of the common star of Mood of the Day and \"Re-encounter\" (2011)?"},{"question":"Which is the smaller dog,  Dalmatian or Norfolk Terrier?"},{"question":"What type of human communication does Papeeha and Hindi have in common?"},{"question":"What did Drake do prior to working with Ricci Riera?"},{"question":"What type of university was the college that Arena Football League player Johnny Sims attended?"},{"question":"What number Grand Master was the person for whom the DemOlay INternational organization is named?"},{"question":"This American artist made the Billboard top 25 and was a well known YouTuber and also for her participation in which NBC singing competition? "},{"question":"Which organization did both Billy McMillen and the Irish National Liberation army have affiliations with until 'the Troubles' 1974?"},{"question":"In 2007 Paddy Considine starred in Hot Fuzz, who was the director?"},{"question":"Claude Nicollier and André Kuipers were both astronauts of which space agency?"},{"question":"Are both Around the World in 80 Days and The Nutcracker and the Four Realms films?"},{"question":"Maurice Hines and his brother were famous for what?"},{"question":"What song was inspired by a breakup and a hit single in 1985?"},{"question":"Who is younger, Bernhard Wicki or Lloyd Kaufman?"},{"question":"What helmet typically associated with the Prussian Army was replaced by a steel helmet during World War I?"},{"question":"Are Gustavus Airport and Augusta Regional Airport located in the same country?"},{"question":"Who were the three leading actors in a film that shows Traitor's Ford?"},{"question":"When was the Associate Justice of the Supreme Court of the United States born under whom Carrie Severino served as a law clerk?"},{"question":"Which was a game for more than two people, Medina or Hijara?"},{"question":"What year did the anchor store of the GVK One mall open?"},{"question":"Does Darren Bravo's half brother bat left-handed or right-handed?"},{"question":"The shopping center that incorporates multiple factory outlets in one center is located on which side of the Adelaide Airport?"},{"question":"The coach of the 2017 Houston Texans coached which team from 2012 to 2013?"},{"question":"Steven \"Steve\" Smith is a politician representing a disctrict that includes a town with how many lakes and ponds?"},{"question":"Which airport is located closer to the equator, Greater Rochester International Airport or Flagstaff Pulliam Airport?"},{"question":"What team, managed by a man who is also and advisor to Central Coast Mariners, won the 2008 FA Cup?"},{"question":"Which film was released later, Shocker or Very Bad Things?"},{"question":"Which municipality established in 2013 is where Cezar Mateus works?"},{"question":"Juan Pablo Di Pace appeared in a musical with music from what successful pop group?"},{"question":"Which group was formed first Hurricane No. 1 or DC Talk?"},{"question":"Which of the following is known for directing \"Die Another Day\": Lee Tamahori or Terry Zwigoff?"},{"question":"What class of submarines is based upon a class of diesel-electric attack submarines jointly developed by French Direction des Construtiones Navales and the Spanish company Navantia?"},{"question":"What was the category of the hurricane that damaged the Hanapepe Town Lot No. 18?"},{"question":"Which British French Crime drama series did William Ash star in?"},{"question":"Which city in California was the sole candidate for the 2028 games, officially known as the Games of the XXXIV Olympiad?"},{"question":"What departed \"Gossip Girl\" cast member was born in 1993?"},{"question":"NanoScale Corporation was founded to develop properties of a university with a main campus in what Kansas city?"},{"question":"Hristo Atanasov Bonev-Zumais a former Bulgarian footballer, the second all-time leading scorer for the Bulgarian national team behind which Bulgarian professional footballer who plays for Indian Super League club Kerala Blasters?"},{"question":"Type 07 military uniforms were first seen during the transfer of sovereignty from the United Kingdom to which country?"},{"question":"Slane Beg is northwest of a town in what Irish county?"},{"question":"Michael Kozlowski handled the career of an Israeli professional boxer who held the WBA super welterweight title in what year?"},{"question":"Which French video game publisher, published the war-theme real-time strategy game \"Conflict Zone\"?"},{"question":"Which documentary was released first, Walking with Cavemen or Life in the Freezer?"},{"question":"Buncle is a name derived from which medieval fortress?"},{"question":"What height was the singer who in 1952, along with Buddy Morrow recorded the song  \"Got You on My Mind ? "},{"question":"What awards did the novel which precedes Count Zero win?"},{"question":"When was the first year reports of Aaron Burr's ghost appearing at One If By Land, Two If By Sea could have started?"},{"question":"You Got the Silver is a song from the album released in what month?"},{"question":"What was the first stage name of the Hollywood Undead frontman that produced the solo studio album 'Nine Lives'?"},{"question":"What is the birth name of the singer who inspired Julie Mintz and is more commonly known as Lana Del Rey?"},{"question":"When was the brother of Chris James born?"},{"question":"The 19th-century transportation route that connected Idependence, Missouri and Santa Fe, New Mexico runs the same path as what east to west highway?"},{"question":"Which is a propaganda film, Triumph of the Will or Food, Inc.?"},{"question":"In 2017 it was ranked as the world's 26th most reputable university and it awarded Kenneth Turner what honorary degree?"},{"question":"Mary and Max and Fantastic Mr. Fox are what kind of movie?"},{"question":"What 1993 movie was Emilie Schindler's husband the subject of?"},{"question":"Which American football coach, who is now the defensive coordinator at Arizona State Sun Devils, succeeded Mike Cavan as the head football coach at Southern Methodist University from 2002 to 2007?"},{"question":"Which band formed farther west, Unwritten Law or Mono Puff?"},{"question":"Which comes later: the day that Aden was born, or the day that IMG re-launched its men's division after its dismantling?"},{"question":"The Black Windmill is a film produced by a man best known for coproducing what? "},{"question":"Are Crash! The bankrupt game and PÜNCT both types of games?"},{"question":"The Rucellai Sepulchre was built by an Italian humanist author who epitomised what?"},{"question":"What position did the Croation goalscorer in the 2009–10 DFB-Pokal season final primarily play?"},{"question":"Which film includes more game organizations, Tar Creek and Monster Camp?"},{"question":"Eric Kissinger currently plays for an outdoor socker team that plays in which region?"},{"question":"The Snake River is a  tributary of which river on which Richland stands?"},{"question":"Which Swedish author and teacher wrote the 1912 novel Thy Soul Shall Bear Witness! ?"},{"question":"In which year was the first of the vampire-themed fantasy romance novels for which The Twilight Saga: The Official Illustrated Guide serves as a spin-off encyclopedic reference book first published?"},{"question":"Tripel beer was first introduced in 1956, by which Belgian abbey brewery?"},{"question":"Which opera has more acts Destiny or Rienzi?"},{"question":"What was Peter Browngradt's best known  animated television series based on?"},{"question":"Which genus is in the verbena family, Citharexylum or Laelia?"},{"question":"Q1: Which actress played roles in both The Perfect Family and Bones?"},{"question":"When did the reality singing competition where a Dutch rapper of Moroccan descent appeared as a judge air?"},{"question":"What type of schools are both Carre's Grammar School and Kesteven and Sleaford High School?"},{"question":"What McMOnagle, Perri & McHugh attorney is notable for representing a hip hop artist with a stage name from a street in South Philadelphia"},{"question":"Justin Warfield released a hip hop album that featured production from the producer of what dual nationality?"},{"question":"What city did Edouard get his MBA in?"},{"question":"The Marathon is a mixtape by a rapper whose recodings inlcude one called what in which which rapper Jay-Z, bought 100 copies for $100 each?"},{"question":"What was the country of origin of one of the major users of Butterfly style in 1980's hockey?"},{"question":"When was the Polish professional boxer over which Joe Smith Jr. rose to prominence in 2016 by scoring an upset knockout victory born? "},{"question":"Of the two, 56 Leonard Street and Latting Observatory, which was known as a wooden tower in New York City?"},{"question":"In what nation is it the job of Mousa Esmaeilpour to support learns or clients in achieving a specific personal or professional goal specifically in bodybuilding?"},{"question":"Where did Richard Gillow found the furniture company, Gillows of Lancaster and London?"},{"question":"What one-time American Red Cross affiliate and African American medical researcher aided Dr. John Scudder with his Plasma for Britain program?"},{"question":"Which midsize car  of 1973 to 2005 used a shared platform with Pontiac 6000?"},{"question":"Are Portsmouth International Airport at Pease and Fort Smith Regional Airport both located in the northeast US?"},{"question":"The American conservative Christian nonprofit organization that Alan Sears served as the president, CEO, and general counsel of until January 2017 is headquartered in what Arizona city?"},{"question":"Which instrument is Clara Rockmore a virtuoso of in the novel Us Conductors?"},{"question":"Nell Hodgson Woodruff School of Nursing awards whatcertification for a doctoral program, other than a PhD?"},{"question":"Which architect that designed 8 House was born on 2 October 1974? "},{"question":"Oumar Tchomogo who was born in Cotonou, where is this city located?"},{"question":"SASTRA Ramanujan Prize was founded in the hometown of the mathematician who compiled nearly how many results?"},{"question":"What is the group's title that covered the song that is the reason that is the main reason the album Raincoats is so well known?"},{"question":"What year did the war during which Pompiliu Ștefu was executed end?"},{"question":" Stony Awards presented a posthumous award to what American cannabis rights activist and the author of \"The Emperor Wears No Clothes\","},{"question":"Which major mid-20th century film director lived longer, Philip Ford or Julien Duvivier?"},{"question":"Do Rika Hiraki and Mara Santangelo come from the same country?"},{"question":"Were The Adventures of Huck Finn and Piglet's Big Movie distributed by the same studio?"}]
