{"duration": 0.012483835220336914, "input_args": {"arg": "'http://future-hgx-1:7143/generate'", "url": "'http://future-hgx-1'", "ports": "(7140, 7141, 7142, 7143)", "**": "{'headers': {'Content-Type': 'application/json'}, 'json': {'inputs': 'Given the fields `context`, `question`, produce the fields `answer`.\\n\\n---\\n\\nQuestion: Who produced the album that included a re-recording of \"Lithium\"?\\nAnswer: Butch Vig\\n\\nQuestion: The heir to the Du Pont family fortune sponsored what wrestling team?\\nAnswer: Foxcatcher\\n\\nQuestion: What documentary about the Gilgo Beach Killer debuted on A&E?\\nAnswer: The Killing Season\\n\\nQuestion: Who was the director of the 2009 movie featuring Peter Outerbridge as William Easton?\\nAnswer: Kevin Greutert\\n\\nQuestion: Which author is English: John Braine or Studs Terkel?\\nAnswer: John Braine\\n\\nQuestion: Which award did the first book of Gary Zukav receive?\\nAnswer: U.S. National Book Award\\n\\n---\\n\\nFollow the following format.\\n\\nContext: ${context}\\n\\nQuestion: ${question}\\n\\nReasoning: Let\\'s think step by step in order to ${produce the answer}. We ...\\n\\nAnswer: ${answer}\\n\\n---\\n\\nContext:\\n[1] «Dolly Parton | Dolly Rebecca Parton Dean (born January 19, 1946) is an American singer, songwriter, multi-instrumentalist, record producer, actress, author, businesswoman, and philanthropist, known primarily for her work in country music. After achieving success as a songwriter for others, Dolly Parton made her album debut in 1967, with her album \"Hello, I\\'m Dolly\". With steady success during the remainder of the 1960s (both as a solo artist and with a series of duet albums with Porter Wagoner), her sales and chart peak came during the 1970s and continuing into the 1980s; Parton\\'s subsequent albums in the later part of the 1990s were lower in sales. However, in the new millennium, Parton achieved commercial success again and has released albums on independent labels since 2000, including albums on her own label, Dolly Records.»\\n[2] «Dollywood Foundation | The Dollywood Foundation, founded by Dolly Parton (born January 19, 1946), an American singer, songwriter, instrumentalist, record producer, actress, author, and businesswoman, began in Pigeon Forge, Tennessee. Shortly after the opening of the Dollywood theme park in 1986, the Dollywood Foundation was created in April 1988, and began by offering scholarships to local high school students. From there it grew into the Imagination Library, started in 1995, which distributes free books to children monthly, up until the age of 5. The Dollywood Foundation recently grew again into the My People Fund, which started in 2016 after wildfires ripped through Tennessee. The current President of the Dollywood Company is Craig Ross. Today, the foundation continues to support people in need by providing scholarships and awards to those who deserve them and provides support to countless non-profit organizations that aim to improve the quality of life to children and others in need.»\\n[3] «Randy Parton | Randle Huston \"Randy\" Parton (born December 15, 1953) is an American singer-songwriter, actor and businessman, best known as the brother of Dolly Parton and Stella Parton. Born in Sevierville, Tennessee, Parton is the eighth of twelve children born to Avie Lee Caroline Owens and Robert Lee Parton Sr.»\\n\\nQuestion: In what year was the star of To Hell and Back born?\\n\\nReasoning: Let\\'s think step by step in order to answer this question. We know that the star of To Hell and Back is Dolly Parton, and we know that she was born on January 19, 1946. Therefore, the answer to the question is 1946.\\n\\nAnswer:', 'parameters': {'do_sample': False, 'best_of': 1, 'details': False, 'temperature': 0.1, 'max_new_tokens': 75, 'top_p': 0.97, 'num_return_sequences': 1, 'stop': ['\\n', '\\n\\n']}}}"}, "time": 1697827626.218275}